curl -XPOST http://localhost:8888/v1/categories \
-H "Content-Type: application/json" \
-d \
'{
    "category": {
        "name": "科技",
        "description": "社会上习惯于把科学和技术连在一起,统称为科学技术,简称科技.实际二者既有密切联系,又有重要区别.科学解决理论问题,技术解决实际问题.科学要解决的问题,是发现自然界中确凿的事实与现象之间的关系,并建立理论把事实与现象联系起来;技术的任务则是把科学的成果应用到实际问题中去.科学主要是和未知的领域打交道,其进展,尤其是重大的突破,是难以预料的;技术是在相对成熟的领域内工作,可以做比较准确的规划."
    }
}'
curl -XPOST http://localhost:8888/v1/categories \
-H "Content-Type: application/json" \
-d \
'{
    "category": {
        "name": "笑话",
        "description": "人类历史上,人自从有了语言,就已经出现了开玩笑的语言,最早,人们以口相传,后来有了文字,许多笑话便被记载下来,编书成册.但还有很多笑话,是流传于民间的,就当今社会,每天都有很多笑话出现,有心人如果收集,我想将来一定会有价值,同时丰富了笑话的宝库.随着近十年网络和手机的飞速发展,随之出现了网络笑话,网络流行语,给力大全,手机笑话,雷人语句,笑料联盟等,促使笑话发展到一个新的阶段.2012年腾讯微信的诞生,与之俱来的又出现了笑话微信,搞笑语句,幽默小故事等,推动动了笑话向移动手机方向的进一步发展."
    }
}'
curl -XPOST http://localhost:8888/v1/categories \
-H "Content-Type: application/json" \
-d \
'{
    "category": {
        "name": "生活",
        "description": "每个人都会询问这个问题: 生活的意义是什么? 在生活中遭受不幸的人会觉得人生没有意义,而即便那些成功者也时常会迷茫于人生的意义是什么?我们要探讨的不是价值观是什么,而是生命的终极意义是什么.显然我们要探讨的问题是不允许涉及宗教的,这将是一个迷人的问题.其实这是一个不可说的哲学问题,任何直面这个问题的答案都难以服众,我们只能绕个弯子,我只告诉你人性的原理和规律,然后由你亲自去找到符合你情景的答案."
    }
}'
curl -XPOST http://localhost:8888/v1/categories \
-H "Content-Type: application/json" \
-d \
'{
    "category": {
        "name": "电影",
        "description": "电影,是由活动照相术和幻灯放映术结合发展起来的一种连续的影像画面,是一门视觉和听觉的现代艺术,也是一门可以容纳戏剧,摄影,绘画,音乐,舞蹈,文字,雕塑,建筑等多种艺术的现代科技与艺术的综合体.但它又具有独自的特征,电影在艺术表现力上不但具有其它各种艺术的特征,又因可以运用蒙太奇法语:Montage这种艺术性突跃的电影组接技巧,具有超越其它一切艺术的表现手段,而且影片可以大量复制放映,随着现代社会的发展,电影已深入到人类社会生活的方方面面,是人们日常生活不可或缺的一部分."
    }
}'
curl -XPOST http://localhost:8888/v1/categories \
-H "Content-Type: application/json" \
-d \
'{
    "category": {
        "name": "情感",
        "description": "[心理学大辞典]中认为:[情感是人对客观事物是否满足自己的需要而产生的态度体验.]同时一般的普通心理学课程中还认为:[情绪和情感都是人对客观事物所持的态度体验,只是情绪更倾向于个体基本需求欲望上的态度体验,而情感则更倾向于社会需求欲望上的态度体验.]但实际上,这一结论一方面将大家公认的幸福,美感,喜爱等,较具有个人化而缺少社会性的感受排斥在情感之外;而另一方面又显然忽视了情绪感受上的喜,怒,忧,思,悲,恐,惊,和社会性情感感受上的爱情,友谊,爱国主义情感在行为过程中具有的交叉现象,例如一个人在追求爱情这一社会性的情感过程中随着行为过程的变化同样也会有各种各样的情绪感受,而爱情感受的稳定性和情绪感受的不稳定性又显然表明了爱情和相关情绪是有区别的.基于这两点,将情感和情绪以基本需要,社会需求相区别,或者将情感和情绪这两者混为一谈都显然不合适"
    }
}'
curl -XPOST http://localhost:8888/v1/categories \
-H "Content-Type: application/json" \
-d \
'{
    "category": {
        "name": "交友",
        "description": "朋友相交,贵在知心.真正的好朋友应该是患难与共,也就是当你需要的时候,他随时都会伸出友谊的手.所以朋友的定义应该是:第一:难予能予——朋友有了困难,需要你的帮助时,即使自己有困难,也应该勉力而为.第二:难作能作——帮朋友做事,只要是好事,纵使做起来不容易也要去做.因为朋友本来就应该互相帮助,能[难作能作],足证友谊之坚.第三:难忍能忍——朋友相处,有时难免会有一些误会,有一些看法上的不同,乃至在语言上发生口角,此时必须互相包容,容忍,尤其要难忍能忍.如果一点包容忍耐的胸襟都没有,再好的朋友也...."
    }
}'
curl -XPOST http://localhost:8888/v1/categories \
-H "Content-Type: application/json" \
-d \
'{
    "category": {
        "name": "自然",
        "description": "英文的NATURE来自拉丁文NATURA,意即天地万物之道(THE COURSE OF THINGS, NATURAL CHARACTER)NATURA希腊文PHYSIS的拉丁文翻译.原意为植物,动物及其他世界面貌自身发展出来的内在特色,而在最早的文献意义为植物. 作为自然为整体的概念──物理学宇宙,是由原本的意义所而伸出来的众多解释之一;一字最早由前苏格拉底哲学家主要使用,并自此渐渐广泛流传开来,道通天下.他的用法因为现代科学方法在几世纪前出现而确立."
    }
}'
curl -XPOST http://localhost:8888/v1/categories \
-H "Content-Type: application/json" \
-d \
'{
    "category": {
        "name": "BUG反馈",
        "description": "[Bug]的创始人格蕾丝·赫柏(Grace Murray Hopper),是一位为美国海军工作的电脑专家,也是最早将人类语言融入到电脑程序的人之一.而代表电脑程序出错的[bug] 这名字,正是由赫柏所取的.1947年9月9日,赫柏对Harvard Mark II设置好17000个继电器进行编程后,技术人员正在进行整机运行时,它突然停止了工作.于是他们爬上去找原因,发现这台巨大的计算机内部一组继电器的触点之间有一只飞蛾,这显然是由于飞蛾受光和热的吸引,飞到了触点上,然后被高电压击死.所以在报告中,赫柏用胶条贴上飞蛾,并把[bug]来表示[一个在电脑程序里的错误],[Bug]这个说法一直沿用到今天"
    }
}'
